@******************************************************************************
@ File：led_on.s
@ 功能：LED点灯程序，点亮LED1
@******************************************************************************       
			
.text
.global _start
_start:		
	 		LDR		R0,=0x56000010     	@R0设为GPBCON寄存器。此寄存器用于选择端口B各引脚的功能：是输出、是输入、还是其他
			MOV	R1,#0x00004000         
			STR		R1,[R0]	 		     	@ 设置GPB7为输出口
		
			LDR		R0,=0x56000014		@R0设为GPBDAT寄存器。此寄存器用于读/写端口B各引脚的数据
			MOV	R1,#0x00000000		@将此值改为0x00000080可让LED1熄灭
			STR		R1,[R0]				@GPB7输出0，LED1点亮
		
MAIN_LOOP:
			B		MAIN_LOOP
